
const fs = require('fs'); // ファイル読み込み用
const kome_kana = ["ガ", "ァ", "ギ", "ャ"]; // 変換先
// 仮名
const kana = [
    "あ", "い", "う", "え", "お",
    "か", "き", "く", "け", "こ",
    "さ", "し", "す", "せ", "そ",
    "た", "ち", "つ", "て", "と",
    "な", "に", "ぬ", "ね", "の",
    "は", "ひ", "ふ", "へ", "ほ",
    "ま", "み", "む", "め", "も",
    "や",       "ゆ",       "よ",
    "ら", "り", "る", "れ", "ろ",
    "わ",       "を",       "ん",
    "ゃ",       "ゅ",       "ょ",
    "ぁ", "ぃ", "ぅ", "ぇ", "ぉ",
    "っ", "ゎ", "゛", "゜"
];

/**
 * json生成
 */
function Create_Conversion_List(){
    let words = [];
    let kome_all = [];
    
    for (let i = 0; i < kana.length; i++){
        let ja = kana[i];
        let kome = "";

        while(true){
            
        }
    }
}